Courses/7140/Lectures/Abstraction/liskov-subst-principle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Liskov Substitution Principle</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Liskov Substitution Principle"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-19T00:29-0400"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">
<a href="http://cecs.wright.edu/~pmateti/Courses/7140/">CS 7140 Advanced Software Engineering</a>
</div>

<div id="content">
<h1 class="title">Liskov Substitution Principle</h1>



<ul>
<li>Let <i>q(x)</i> be a property provable about objects of type T.  Then <i>q(y)</i>
  should be provable for objects y of type S where S is a subtype of
  T.
</li>
</ul>


<p>
Less formal statements of the above are:
</p>
<ol>
<li>Derived Types must be substitutable for Base Types.
</li>
<li>"Functions that use pointers or references to base classes must
   be able to use objects of derived classes without knowing it."

</li>
<li>LSP defines a subtyping relation known as <i>(strong) behavioral    subtyping</i>
<ol>
<li>Preconditions cannot be strengthened in a subtype.
</li>
<li>Postconditions cannot be weakened in a subtype.
</li>
<li>Invariants of the supertype must be preserved in a subtype.
</li>
</ol>

</li>
<li>OOD Open-Close Principle: Open for extension but Closed for modifications
</li>
</ol>


<p>
In the context of Java and C++, treat "type" as a synonym for "class".
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> References</h2>
<div class="outline-text-2" id="text-1">


<ol>
<li>Liskov, Barbara H., and Jeannette M. Wing. "A behavioral notion of
   subtyping." ACM Transactions on Programming Languages and Systems
   (TOPLAS) 16.6 (1994): 1811-1841.
   <a href="http://www.cse.ohio-state.edu/~neelam/courses/788/lwb.pdf">http://www.cse.ohio-state.edu/~neelam/courses/788/lwb.pdf</a>.   Liskov is a
   Turing Award Winner 2008.  Required Reading.

</li>
<li>Web site, <a href="http://www.oodesign.com">http://www.oodesign.com</a>  Recommended Visit

</li>
<li>Bob Tarr, UMBC.edu,
   <a href="http://userpages.umbc.edu/~tarr/dp/lectures/OOPrinciples.pdf">Some OOD Principles</a> PDF Slides Recommended Reading
</li>
</ol>

</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
